Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: To restore Jackson's default behavior, use `quarkus.jackson.write-dates-as-timestamps=true` in your `application.properties`. For custom date format on a single field, use the `@JsonFormat` annotation.
ja_jp: Jackson のデフォルトの動作を復元するには、`application.properties` で `quarkus.jackson.write-dates-as-timestamps=true` を使用します。 単一フィールドのカスタム日付形式の場合は、`@JsonFormat` アノテーションを使用します。

source: To restore it and with the help of the `@WithBridgeMethods` annotation, the GitHub API build will create two methods in the bytecode: one returning `GHMyself` and one returning `GHUser`. This is very useful if you have compiled your application with an old version of the GitHub API and you just want to use the new version without recompiling your application. Typically, in the case of Jenkins, you can switch to a new version of the GitHub API without having to recompile all the Jenkins plugins using GitHub API.
ja_jp: これを復元するために、 `@WithBridgeMethods` アノテーションの助けを借りて、GitHub API ビルドはバイトコードに 2 つのメソッドを作成します。1 つは `GHMyself` を返し、もう 1 つは `GHUser` を返します。これは、GitHub APIの古いバージョンでアプリケーションをコンパイルしていて、アプリケーションを再コンパイルせずに新しいバージョンを使いたい場合に非常に便利です。一般的にJenkinsの場合、GitHub APIを使用するJenkinsプラグインをすべて再コンパイルすることなく、GitHub APIの新しいバージョンに切り替えることができます。

source: To restrict access to public resources for anonymous users, define an enforcing Keycloak Authorization Policy:
ja_jp: 匿名ユーザーによるパブリックリソースへのアクセスを制限するには、強制的な Keycloak Authorization Policy を定義します。

source: To retrieve an Author from the index, execute a simple search -- more on search later -- by identifier.
ja_jp: インデックスから Author を取得するには、識別子による簡単な検索 を実行します (検索については後ほど詳しく説明します)。

source: To retrieve an increment using its key, we will have to run the below command:
ja_jp: キーを使ってインクリメントを取得するには、以下のコマンドを実行する必要があります:

source: To retrieve fruits with the reactive REST endpoint:
ja_jp: リアクティブ REST エンドポイントを使用して fruit を取得するには以下を実行します。

source: To retrieve fruits:
ja_jp: Fruit を回収するには以下を実行します。

source: To retrieve the `URI` that Quarkus is serving on, use `HttpServer#getLocalBaseUri()`. In tests, the URI can be directly injected with `@TestHTTPResource`:
ja_jp: Quarkus がサービスを提供している `URI` を取得するには、 `HttpServer#getLocalBaseUri()` を使用します。テストでは、 `@TestHTTPResource` を使用して URI を直接インジェクションできます。

source: To retrieve the real port, use the `io.quarkus.grpc.runtime.GrpcServer` API, which can be injected into the application code as a CDI Bean:
ja_jp: 実際のポートを取得するには、アプリケーションコードに CDI Bean として注入できる `io.quarkus.grpc.runtime.GrpcServer` API を使用します。

source: To retrieve the real port, use the `io.quarkus.vertx.http.HttpServer` API, which can be injected into the application code as a CDI Bean:
ja_jp: 実際のポートを取得するには、 `io.quarkus.vertx.http.HttpServer` API を使用します。これは CDI Bean としてアプリケーションコードにインジェクションできます。

source: To revert to Jackson's default behavior, set `quarkus.jackson.fail-on-unknown-properties=true` in your `application.properties`, or set it on a per-class basis with `@JsonIgnoreProperties(ignoreUnknown = false)`.
ja_jp: Jackson のデフォルトの動作に戻すには、`application.properties` で `quarkus.jackson.fail-on-unknown-properties=true` を設定するか、`@JsonIgnoreProperties(ignoreUnknown = false)` を使用してクラスごとに設定します。

source: To run Integration Tests on the native executable, make sure to have the proper <<build-tool-maven,Maven plugin configured>> and launch the `verify` goal.
ja_jp: ネイティブ実行可能ファイルで統合テストを実行するには、適切な xref:build-tool-maven[Maven プラグインが設定] されているようにし、 `verify` ゴールを起動します。

source: To run Integration Tests on the native executable, make sure to have the proper Maven plugin configured (see <<build-tool-maven>>) and launch the `verify` goal.
ja_jp: ネイティブ実行可能ファイルで統合テストを実行するには、適切なMavenプラグインが設定されていることを確認し( link:#build-tool-maven[[build-tools-maven]] を参照)、 `verify` ゴールを起動します。

source: To run Integration Tests on the native executable, make sure to have the proper xref:build-tool-maven[Maven plugin configured] and launch the `verify` goal.
ja_jp: ネイティブ実行可能ファイルで Integration Tests を実行するには、適切な Maven xref:build-tool-maven[プラグインが設定] されているようにし、 `verify` ゴールを起動します。

source: To run both the `producer` and `aggregator` applications in native mode, the Maven builds can be executed using `-Dnative`:
ja_jp: `producer` と `aggregator` の両方のアプリケーションをネイティブモードで実行するには、 `-Dnative` を使って Maven ビルドを実行します:

source: To run it, just pass in `-Dquarkus.dev`, i.e.:
ja_jp: 実行するには、 `-Dquarkus.dev` を渡すだけです:

source: To run tests on the resulting image, `quarkus.container-image.build=true` needs to be set using any of the ways that Quarkus supports.
ja_jp: 作成されたイメージでテストを実行するためには、Quarkus がサポートしている方法のいずれかで、 `quarkus.container-image.build=true` を設定する必要があります。

source: To run the application in a dev mode, use:
ja_jp: アプリケーションを開発モードで実行するには、次を使用します。

source: To run the application in dev mode, run the following commands:
ja_jp: 開発モードでアプリケーションを実行するには、次のコマンドを実行します。

source: To run the application in dev mode, use:
ja_jp: アプリケーションを開発モードで実行するには、次を使用します:

source: To run the application in development mode, use the following command:
ja_jp: アプリケーションを開発モードで実行するには、次のコマンドを使用します。

source: To run the application, don’t forget to start a database and provide the configuration to your application.
ja_jp: アプリケーションを実行するには、データベースを起動し、アプリケーションに設定を提供することを忘れないでください。

source: To run the command mode application on the JVM, first build it using `mvnw package` or equivalent.
ja_jp: JVM上でコマンド・モード・アプリケーションを実行するには、まず `mvnw package` または同等のものを使ってビルドします。

source: To run the deploy, after you build your project execute:
ja_jp: デプロイを実行するには、プロジェクトをビルドした後、次のコマンドを実行してください:

source: To run the microservice in dev mode, use:
ja_jp: マイクロサービスを dev モードで実行する場合、次を実行して下さい:

source: To run these tests, choose `Press [r] to resume testing` option which is shown in the console after you started your application in dev mode.
ja_jp: これらのテストを実行するには、アプリケーションを dev モードで起動した後にコンソールに表示される `Press [r] to resume testing` オプションを選択します。

source: To run this deployment, it is not necessary to have the `quarkus-openshift` extension included in your {project-name} project.
ja_jp: このディプロイメントを実行するには、 `quarkus-openshift` エクステンションを {project-name} プロジェクトに含める必要はありません。

source: To run this playbook, you use again the ansible-playbook command, but providing now the path to the playbook:
ja_jp: このプレイブックを実行するには、再びansible-playbookコマンドを使用しますが、今度はプレイブックへのパスを指定します：

source: To run your application in dev mode:
ja_jp: アプリケーションを dev モードで実行するには、以下を実行します。

source: To run your applications as native, first we need to build the native executables:
ja_jp: アプリケーションをネイティブとして実行するには、最初にネイティブ実行可能ファイルをビルドする必要があります。

source: To scaffold a Gradle project you can either use the xref:cli-tooling.adoc[Quarkus CLI] or the Quarkus Maven plugin:
ja_jp: Gradleプロジェクトを生成するには、 link:cli-tooling.html[Quarkus CLI]またはQuarkus Mavenプラグインを使用できます:

source: To schedule a Job execution, please refer to the quarkus.jberet.job.”job-name”.cron and quarkus.jberet.job.”job-name”.params.”param-key” configurations.
ja_jp: ジョブ実行をスケジュールするには、quarkus.jberet.job.”job-name”.cron および quarkus.jberet.job.”job-name”.params.”param-key” の設定を参照してください。

source: To secure TLS 1.2 and earlier, set `jdk.tls.rejectClientInitiatedRenegotiation` to `true` to prevent client-initiated renegotiation.
ja_jp: TLS 1.2 以前を保護するには、`jdk.tls.rejectClientInitiatedRenegotiation` を `true` に設定して、クライアントが開始した再ネゴシエーションを防止します。

source: To secure the incoming connections, Kubernetes allows enabling https://kubernetes.io/docs/concepts/services-networking/ingress/#tls[TLS] within the Ingress resource by specifying a Secret that contains a TLS private key and certificate. You can generate a secured Ingress resource by simply adding the "tls.secret-name" properties:
ja_jp: 着信接続を保護するために、Kubernetes では、TLS 秘密鍵と証明書を含むシークレットを指定することで、Ingress リソース内で https://kubernetes.io/docs/concepts/services-networking/ingress/#tlsTLS を有効にすることができます。tls.secret-name プロパティーを追加するだけで、安全な Ingress リソースを生成できます。

source: To secure the incoming connections, OpenShift provides several types of TLS termination to serve certifications.
ja_jp: 着信接続を保護するために、OpenShift は証明書を提供するためにいくつかのタイプの TLS 終端を提供します。

source: To secure the incoming connections, OpenShift provides several types of TLS termination to serve certifications. You can read more information about how to secure routes in https://docs.openshift.com/container-platform/4.12/networking/routes/secured-routes.html[the official OpenShift guide].
ja_jp: 着信接続を保護するために、OpenShift は証明書を提供するためにいくつかのタイプの TLS 終端を提供します。 link:https://docs.openshift.com/container-platform/4.12/networking/routes/secured-routes.html[OpenShiftの公式ガイド] で、Routeを保護する方法の詳細を読むことができます。

source: To see Quarkus events in chronological order on a thread, select the `Java application` and `Threads` on the left side of JMC.
ja_jp: スレッド上の Quarkus イベントを時系列順に表示するには、JMC の左側にある `Java application` と `Threads` を選択します。

source: To see a list of events using JMC, first we load the JFR file in JMC as follows.
ja_jp: JMC を使用してイベントのリストを表示するには、まず以下のように JMC に JFR ファイルをロードします。

source: To see additional capabilities of the Kogito platform, you can reference the Kogito documentation at the links below. This includes more detailed guides about integrating with Processes (BPMN2), Rules (Drools' DRL), Prediction (PMML), Test Scenario (visual notation for testing), assisted deployment to OpenShift, and many more.
ja_jp: Kogitoプラットフォームの追加機能を知るには、以下のリンクでKogitoのドキュメントを参照して下さい。これには、プロセス（BPMN2）、ルール（DroolsのDRL）、予測（PMML）、テストシナリオ（テストのための視覚的記法）、OpenShiftへのアシストデプロイメントなどとの統合に関するより詳細なガイドが含まれています。

source: To see details about the OidcProvider client initialization errors, enable `io.quarkus.oidc.runtime.OidcRecorder` `TRACE` level logging:
ja_jp: OidcProvider クライアントの初期化エラーの詳細を確認するには、 `io.quarkus.oidc.runtime.OidcRecorder` の `TRACE` レベルのロギングを有効にしてください。

source: To see details about the token verification errors, you must enable `io.quarkus.oidc.runtime.OidcProvider` `TRACE` level logging:
ja_jp: トークン検証エラーの詳細を確認するには、 `io.quarkus.oidc.runtime.OidcProvider` の `TRACE` レベルのロギングを有効にする必要があります。

source: To see more details about `OidcProvider` client initialization errors, enable `io.quarkus.oidc.runtime.OidcRecorder` and `TRACE` level logging as follows:
ja_jp: `OidcProvider` クライアント初期化エラーの詳細を確認するには、次のように `io.quarkus.oidc.runtime.OidcRecorder` および `TRACE` レベルのロギングを有効にします。

source: To see more details about token verification errors, enable `io.quarkus.oidc.runtime.OidcProvider` and `TRACE` level logging:
ja_jp: トークン検証エラーの詳細を確認するには、 `io.quarkus.oidc.runtime.OidcProvider` および `TRACE` レベルのロギングを有効にします。

source: To see multitenancy in action, you can check out the link:{quickstarts-tree-url}/hibernate-orm-multi-tenancy-quickstart[hibernate-orm-multi-tenancy-quickstart] quickstart.
ja_jp: マルチテナンシーの動作を確認するには、 link:{quickstarts-tree-url}/hibernate-orm-multi-tenancy-quickstart[hibernate-orm-multi-tenancy-quickstart] クイックスタートをご覧ください。

source: To see multitenancy in action, you can check out the link:{quickstarts-tree-url}/hibernate-orm-multi-tenancy-schema-quickstart[hibernate-orm-multi-tenancy-schema-quickstart] or link:{quickstarts-tree-url}/hibernate-orm-multi-tenancy-database-quickstart[hibernate-orm-multi-tenancy-database-quickstart].
ja_jp: マルチテナンシーの動作を確認するには、 link:{quickstarts-tree-url}/hibernate-orm-multi-tenancy-schema-quickstart[hibernate-orm-multi-tenancy-schema-quickstart] または link:{quickstarts-tree-url}/hibernate-orm-multi-tenancy-database-quickstart[hibernate-orm-multi-tenancy-database-quickstart] をご覧ください。

source: To see multitenancy in action, you can check out the {quickstarts-tree-url}/hibernate-orm-multi-tenancy-quickstart[hibernate-orm-multi-tenancy-quickstart] quickstart.
ja_jp: マルチテナンシーの動作を確認するには、 {quickstarts-tree-url}/hibernate-orm-multi-tenancy-quickstart[hibernate-orm-multi-tenancy-quickstart] クイックスタートをご覧ください。

source: To see that that the failures still happen, check the output of the development server. The log messages should be similar to these:
ja_jp: 障害がまだ発生していることを確認するには、開発サーバーの出力を確認してください。ログメッセージは以下のようになっているはずです。

source: To see that the failures still happen, check the output of the development server. The log messages should be similar to these:
ja_jp: 障害がまだ発生していることを確認するには、開発サーバーの出力をチェックします。ログメッセージは以下のようになっているはずです。 :

source: To see the Hibernate ORM REST Data with Panache in action, you can check out the link:{quickstarts-tree-url}/hibernate-orm-rest-data-panache-quickstart[hibernate-orm-rest-data-panache-quickstart] quickstart.
ja_jp: Panacheを使用したHibernate ORM REST Dataの動作を確認するには、 link:{quickstarts-tree-url}/hibernate-orm-rest-data-panache-quickstart[hibernate-orm-rest-data-panache-quickstart] クイックスタートをご覧ください。

source: To see the Hibernate ORM REST Data with Panache in action, you can check out the {quickstarts-tree-url}/hibernate-orm-rest-data-panache-quickstart[hibernate-orm-rest-data-panache-quickstart] quickstart.
ja_jp: Hibernate ORM REST Data with Panacheの動作を確認するには、 {quickstarts-tree-url}/hibernate-orm-rest-data-panache-quickstart [hibernate-orm-rest-data-panache-quickstart] クイックスタートで確認することができます。

source: To see the `GreetingResourceIT` run against the native executable, use `./mvnw verify -Dnative`:
ja_jp: `GreetingResourceIT` がネイティブ実行可能ファイルに対して実行されることを確認するには、 `./mvnw verify -Pnative` を使用します。

source: To see the `GreetingResourceIT` run against the native executable, use `./mvnw verify -Pnative`:
ja_jp: `GreetingResourceIT` がネイティブ実行可能ファイルに対して実行されるのを確認するには、 `./mvnw verify -Pnative` を使用します:

source: To see the `NativeGreetingResourceIT` run against the native executable, use `./mvnw verify -Pnative`:
ja_jp: `NativeGreetingResourceIT` がネイティブ実行可能ファイルに対して実行されているのを見るには、 `./mvnw verify -Pnative` を使用します。

source: To see the `usage` statement, and validate AWS configuration:
ja_jp: `usage` を参照したり、AWS の設定を検証するためには次のようにします。

source: To see the full list of settings, please refer to the link:https://docs.datastax.com/en/developer/java-driver/latest/manual/core/configuration/reference/[driver settings reference].
ja_jp: 設定の全リストを見るには、 link:https://docs.datastax.com/en/developer/java-driver/latest/manual/core/configuration/reference/[ドライバーの設定リファレンス] を参照してください。

source: To see the list of current increments keys, run the following command:
ja_jp: 現在のインクリメントキーのリストを表示するには、以下のコマンドを実行します:

source: To see this feature in action, first execute:
ja_jp: この機能の動作を確認するには、まず次のコマンドを実行します:

source: To see this in action with a very basic example, add a new `TimestampResource` to the application that looks like this:
ja_jp: これの実際の動作を非常に基本的な例で確認するには、以下のような新しい `TimestampResource` をアプリケーションに追加します。

source: To see this in action, we'll put OpenAPI documentation under `META-INF/openapi.yaml` for our `/fruits` endpoints. Quarkus also supports alternative <<open-document-paths, OpenAPI document paths>> if you prefer.
ja_jp: これを実際に確認するために、 `META-INF/openapi.yaml` のOpenAPIドキュメントを `/fruits` エンドポイントで公開します。Quarkusでは、必要に応じて代替の link:#open-document-paths[OpenAPIドキュメントパス] もサポートしています。

source: To see this in action, we'll put OpenAPI documentation under `META-INF/openapi.yaml` for our `/fruits` endpoints. Quarkus also supports alternative <<open-document-paths,OpenAPI document paths>> if you prefer.
ja_jp: この動作を確認するために、`/fruits` のエンドポイントについて、OpenAPI ドキュメントを `META-INF/openapi.yaml` の下に置いてみます。希望に応じて、Quarkus は <<open-document-paths,OpenAPI document paths>> もサポートしています。

source: To see this in action, we'll put OpenAPI documentation under `META-INF/openapi.yaml` for our `/fruits` endpoints. Quarkus also supports alternative xref:open-document-paths[OpenAPI document paths] if you prefer.
ja_jp: この動作を確認するために、 `/fruits` のエンドポイントについて、OpenAPIドキュメントを `META-INF/openapi.yaml` の下に置いてみます。希望に応じて、Quarkusは xref:open-document-paths[OpenAPIドキュメントの代替パス] もサポートしています。

source: To see traces, select the `tempo` data source and query for data:
ja_jp: トレースを表示するには、 `tempo` データソースを選択し、データをクエリーします。

source: To select the gRPC server implementation, set the `quarkus.grpc.server.use-separate-server` property in your `application.properties` file:
ja_jp: gRPC サーバーの実装を選択するには、 `application.properties` ファイルで `quarkus.grpc.server.use-separate-server` プロパティーを設定します。

source: To select which extension will be used for building the image:
ja_jp: イメージのビルドに使用するエクステンションを選択するには次のようにします。

source: To send a simple email, proceed as follows:
ja_jp: 簡単なメールを送信するには、次のようにします:

source: To send attachments, just use the `addAttachment` methods on the `io.quarkus.mailer.Mail` instance:
ja_jp: 添付ファイルを送信するには、 `io.quarkus.mailer.Mail` インスタンスの `addAttachment` メソッドを使用するだけです:

source: To send data as a multipart form, you can just use the regular `@RestForm` (or `@FormParam`) annotations:
ja_jp: データをマルチパートフォームとして送信するには、通常の `@RestForm` (または `@FormParam` ) アノテーションを使用します:

source: To send data as a multipart form, you need to create a class that would encapsulate all the fields to be sent, e.g.
ja_jp: マルチパートフォームとしてデータを送信するには、送信するすべてのフィールドをカプセル化するクラスを作成する必要があります。例えば、次のようにします。

source: To send logs to Graylog, you first need to launch the components that compose the Graylog stack:
ja_jp: Graylogにログを送信するには、まずGraylogスタックを構成するコンポーネントを起動する必要があります:

source: To send logs to a centralized tool such as Graylog, Logstash, or Fluentd, see the Quarkus xref:centralized-log-management.adoc[Centralized log management] guide.
ja_jp: Graylog、Logstash、Fluentdなどの集中型ツールにログを送信するには、Quarkusの xref:centralized-log-management.adoc[集中型ログ管理] ガイドを参照してください。

source: To send messages from imperative code to a specific channel, you need to inject an `Emitter` object identified by the `@Channel` annotation:
ja_jp: 命令型コードから特定のチャネルにメッセージを送信するには、`@Channel` アノテーションで識別される `Emitter` オブジェクトを注入する必要があります。

source: To send messages to Kafka from an HTTP endpoint, inject an `Emitter` (or a `MutinyEmitter`) in your endpoint:
ja_jp: HTTP エンドポイントから Kafka にメッセージを送信するには、エンドポイントに `Emitter` (または `MutinyEmitter`) を注入します。

source: To send messages to RabbitMQ:
ja_jp: RabbitMQ にメッセージを送信する場合。

source: To send to Kafka entities managed by Hibernate Reactive, we recommend using:
ja_jp: Hibernate Reactive によって管理されている Kafka エンティティーに送信するには、以下を使用することをお勧めします。

source: To serve static resources from the application jar, you must place them in the `META-INF/resources` directory of your application. This location was chosen as it is the standard location for resources in `jar` files as defined by the Servlet spec. Even though Quarkus can be used without Servlet, following this convention allows existing code that places its resources in this location to function correctly.
ja_jp: アプリケーションjarから静的リソースを提供するには、それらをアプリケーションの `META-INF/resources` ディレクトリに配置する必要があります。この場所は、Servlet仕様で定義されている `jar` ファイルのリソースの標準的な場所として選択されています。QuarkusはServletなしで使用できますが、この規約に従って、リソースをこの場所に配置する既存のコードを正しく機能させることができます。

source: To serve static resources you must place them in the `META-INF/resources` directory of your application. This location was chosen as it is the standard location for resources in `jar` files as defined by the Servlet spec. Even though Quarkus can be used without Servlet following this convention allows existing code that places its resources in this location to function correctly.
ja_jp: 静的リソースを提供するには、アプリケーションの `META-INF/resources` ディレクトリーに配置する必要があります。この場所が選ばれたのは、Servlet 仕様で定義されているように `jar` ファイル内のリソースの標準的な場所であるためです。Quarkus は Servlet なしで使用することができますが、この規則に従うことで、リソースをこの場所に配置する既存のコードが正しく機能するようになります。

source: To serve static resources you must place them in the `META-INF/resources` directory of your application. This location was chosen as it is the standard location for resources in `jar` files as defined by the Servlet spec. Even though Quarkus can be used without Servlet, following this convention allows existing code that places its resources in this location to function correctly.
ja_jp: 静的リソースを提供するには、アプリケーションの `META-INF/resources` ディレクトリーに配置する必要があります。この場所が選択されたのは、サーブレット仕様で定義されているように `jar` ファイル内のリソースの標準的な場所であるためです。 Quarkus はサーブレットなしで使用することができますが、この規約に従うことで、リソースをこの場所に配置する既存のコードが正しく機能するようになります。

source: To set custom command (say `custom-wait-for`) on the init container that waits for the `flyway` job:
ja_jp: `flyway` ジョブを待つ init コンテナにカスタムコマンド（ `custom-wait-for` ）を設定：

source: To set headers for a gRPC call, create a client with headers attached and then perform the call on this client:
ja_jp: gRPCコールにヘッダを設定するには、ヘッダを付加したクライアントを作成し、このクライアントで呼び出しを実行します。

source: To set the `imagePullPolicy` to `IfNotPresent` on the init container that waits for the `flyway` job:
ja_jp: `flyway` ジョブを待機する init コンテナで、 `imagePullPolicy` を `IfNotPresent` に設定します：

source: To set the cookie path dynamically, configure the `quarkus.oidc.authentication.cookie-path-header` property. For example, to set the cookie path dynamically by using the value of the `X-Forwarded-Prefix` HTTP header, configure the property to `quarkus.oidc.authentication.cookie-path-header=X-Forwarded-Prefix`.
ja_jp: Cookie パスを動的に設定するには、 `quarkus.oidc.authentication.cookie-path-header` プロパティーを設定します。 たとえば、 `X-Forwarded-Prefix` HTTP ヘッダーの値を使用して Cookie パスを動的に設定するには、プロパティーを `quarkus.oidc.authentication.cookie-path-header=X-Forwarded-Prefix` に設定します。

source: To set the cookie path dynamically, configure the `quarkus.oidc.authentication.cookie-path-header` property. Set the `quarkus.oidc.authentication.cookie-path-header` property. For example, to set the cookie path dynamically by using the value of the`X-Forwarded-Prefix` HTTP header, configure the property to `quarkus.oidc.authentication.cookie-path-header=X-Forwarded-Prefix`.
ja_jp: クッキーパスを動的に設定するには、 `quarkus.oidc.authentication.cookie-path-header` プロパティーを設定します。 `quarkus.oidc.authentication.cookie-path-header` プロパティーを設定します。 たとえば、 `X-Forwarded-Prefix` HTTP ヘッダーの値を使用してクッキーパスを動的に設定するには、プロパティーを `quarkus.oidc.authentication.cookie-path-header=X-Forwarded-Prefix` に設定します。

source: To set the desired MongoDB version that will be launched, the following code should be used:
ja_jp: 起動するMongoDBのバージョンを任意に設定するには、次のコードを使用します。

source: To set the desired port MongoDB will listen to when it is launched, the following code should be used:
ja_jp: MongoDB が起動時にリッスンする希望のポートを設定するには、次のコードを使用します。

source: To set the imagePullPolicy to `IfNotPresent` on the init container that waits for the `flyway` job:
ja_jp: `flyway` ジョブを待つ init コンテナで imagePullPolicy を `IfNotPresent` に設定：

source: To set the initial delay of the probe to 20 seconds and the period to 45:
ja_jp: プローブの初期遅延を 20 秒、周期を 45 秒に設定します。

source: To set the maximum idle time, provide the duration (see note on duration's format below) via the `quarkus.hibernate-orm.cache."<region_name>".expiration.max-idle` property (Replace _<region_name>_ with the actual region name).
ja_jp: 最大アイドル時間を設定するには、 `quarkus.hibernate-orm.cache."<region_name>".expiration.max-idle` プロパティー (_<region_name>_ は実際のリージョン名に置き換えます) を介して時間 (下記の時間のフォーマットに関する注意を参照) を指定します。

source: To set up and configure Hibernate ORM, <<hibernate-configuration-properties,using `application.properties`>> is recommended, but you can alternatively use a `META-INF/persistence.xml` file. This is mainly useful for migrating existing code to Quarkus.
ja_jp: Hibernate ORM をセットアップして設定するには、<<hibernate-configuration-properties,using `application.properties`>> が推奨されます。 ただし、代わりに `META-INF/persistence.xml` ファイルを使用することもできます。 これは主に、既存のコードを Quarkus に移行する場合に役立ちます。

source: To set up mutual TLS (mTLS) in your {project-name} application, configure the server and the client by creating and managing both a keystore and a truststore for each:
ja_jp: {project-name} アプリケーションで相互 TLS (mTLS) を設定するには、サーバーとクライアントにキーストアとトラストストアの両方を作成して管理することで、それぞれを設定します。

source: To set up this feature for the management interface, include the following lines in `src/main/resources/application.properties`:
ja_jp: マネジメントインタフェースにこの機能を設定するには、 `src/main/resources/application.properties` に次の設定を記述します:

source: To set up this feature, please include the following lines in `src/main/resources/application.properties`:
ja_jp: この機能を設定するには、 `src/main/resources/application.properties` に以下の行を記述してください。
